// 004_Var.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.


/*
* 스코프 = 함수의 영역. 함수의 시작과 끝
* 변수를 쓰려면 변수의 자료형과 이름을 선언한다. 
* 변수의 자료형을 선언하는 이유 = 1.저장공간을 얼마만큼 할당할지 2. 내용물의 
* 변수의 이름을 선언하는 이유 = 변수의 이름은 프로세스에서 상대적 위치를 알려주는 식별자( 프로세스의 ram시작점 0바이트에서 n번째 바이트에 해당이름의 변수를 할당한다) <=컴파일러가 자동으로 해줌
* 
* 
* 
* 
*/

#include <iostream>

int main()
{
    int PlayerAtt;
    int PlayerHP;
    int MonsterHP;
    int MonsterAtt;
    std::cout << "Hello World!\n";
}

// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
